import os
from typing import Final

TOKEN: Final = os.environ.get("TOKEN")  # token Telegram Bot API
MONGODB_REF = "mongodb+srv://DosimeterBot:dG7ntC7sa1RrDpBp@cluster.s3cxd.mongodb.net/users_db?retryWrites=true&w" \
              "=majority"
MONGO_DB: Final = "users_db"
LOGIN_MONGO_DB: Final = "DosimeterBot"
PASSWORD_MONGO_DB: Final = os.environ.get("PASSWORD_MONGO_DB")
URL1: Final = 'https://rad.org.by/radiation.xml'
URL2: Final = 'https://rad.org.by/monitoring/radiation'
DESCRIPTION = 'Этот бот может информировать пользователя по состоянию на текущую дату о радиационной обстановке ' \
              'в Беларуси и об уровне мощности эквивалентной дозы гамма-излучения, зафиксированного в сети ' \
              'радиационного мониторинга Министерства природных ресурсов и охраны окружающей среды Беларуси ' \
              'Источник: ©rad.org.by Разработано: ©itrexgroup.com'
LOCATION_OF_MONITORING_POINTS: Final = {
    'Могилев': (53.69298772769127, 30.375068475712993),
    'Мстиславль': (54.025123497951235, 31.742790754635983),
    'Полоцк': (55.47475184602021, 28.751296645976183),
    'Шарковщина': (55.36281482842422, 27.456996363944278),
    'Минск': (53.92751824354786, 27.63548838979854),
    'Лынтупы': (55.04878637860638, 26.306634538263953),
    'Высокое': (52.366928433095, 23.38374438625246),
    'Пружаны': (52.567268449727045, 24.48545241420398),
    'Слуцк': (53.05284098247522, 27.552283199561725),
    'Брагин': (51.7969974359342, 30.246689891878724),
    'Орша': (54.503170699795774, 30.443815788156527),
    'Мозырь': (52.036635775856084, 29.1925370196736),
    'Славгорорд': (53.45088516337511, 31.003458658160586),
    'Василевичи': (52.25207675198943, 29.838848231201965),
    'Жлобин': (52.89414619807851, 30.043705893277984),
    'Горки': (54.30393502455042, 30.94344246329931),
    'Волковыск': (53.16692103793095, 24.448995268762964),
    'Октябрь': (52.63342658653018, 28.883476209528087),
    'Костюковичи': (53.35847386774336, 32.070027796122154),
    'Брест': (52.116580901478635, 23.685652135212752),
    'Бобруйск': (53.20853347538013, 29.127272432117724),
    'Ивацевичи': (52.716654759080775, 25.350471424000386),
    'Вилейка': (54.48321442087189, 26.89989831916185),
    'Борисов': (54.26563317790094, 28.49760585109516),
    'Житковичи': (52.21411222651425, 27.870082634924596),
    'Ошмяны': (54.43300284193779, 25.935350063150867),
    'Березино': (53.82838181057285, 28.99727106523084),
    'Пинск': (52.12223760297976, 26.111811093605997),
    'Витебск': (55.25257562100984, 30.250042135934226),
    'Лида': (53.90227318372977, 25.32336091231988),
    'Барановичи': (53.13190185894763, 25.97158074066798),
    'Столбцы': (53.46677208676115, 26.732607935963017),
    'Полесская, болотная': (52.29983981155924, 26.667029013394274),
    'Дрогичин': (52.20004370649066, 25.0838433995118),
    'Гомель': (52.402061468751455, 30.963081201303428),
    'Нарочь, озерная': (54.899256667266, 26.684290791688372),
    'Воложин': (54.10018849587838, 26.51694607389268),
    'Верхнедвинск': (55.8208765412649, 27.940101948630605),
    'Сенно': (54.80456568197694, 29.687798174910593),
    'Гродно, АМСГ': (53.60193676812893, 24.05807929514318),
    'Мокраны': (51.83469016263843, 24.262048260884608),
    'Олтуш': (51.69107406162166, 23.97093118533709),
    'Верхний Теребежов': (51.83600602350391, 26.725999562270026),
    'Глушкевичи': (51.61087690551236, 27.825665051237728),
    'Словечно': (51.63093077915665, 29.068442241735667),
    'Новая Иолча': (51.49095727903912, 30.531611339649682),
}

ADMINISTRATIVE_DIVISION: Final = {
    "Брестская область": ['Высокое', 'Пружаны', 'Брест', 'Ивацевичи', 'Пинск', 'Барановичи',
                          'Полесская, болотная', 'Дрогичин', 'Мокраны', 'Олтуш', 'Верхний Теребежов'],
    "Витебская область": ['Полоцк', 'Шарковщина', 'Лынтупы', 'Орша', 'Витебск', 'Нарочь, озерная',
                          'Верхнедвинск', 'Сенно'],
    "Гродненская область": ['Волковыск', 'Ошмяны', 'Лида', 'Гродно, АМСГ'],
    "Могилевская область": ['Могилев', 'Мстиславль', 'Славгорорд', 'Горки', 'Костюковичи', 'Бобруйск'],
    "Минск и Минская область": ['Минск', 'Слуцк', 'Вилейка', 'Борисов', 'Березино', 'Столбцы',
                                'Нарочь, озерная', 'Воложин'],
    "Гомельская область": ['Брагин', 'Мозырь', 'Василевичи', 'Жлобин', 'Октябрь', 'Житковичи',
                           'Гомель', 'Глушкевичи', 'Словечно', 'Словечно']
}
